Autodesk.Revit.DB.ElementIntersectsFilter.IsElementSupported(Autodesk.Revit.DB.Element)
Identifies if the input element is supported by element intersection filters.
element:
The element.
Returns:
True if the element is supported, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsFilter.IsCategorySupported(Autodesk.Revit.DB.Element)
Identifies if the input element is of a category supported by element intersection filters.
element:
The element.
Returns:
True if the element category is supported, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsFilter
A base class for filters used to match elements which intersect with geometry.
Since:
2012